
###############################################################################
# Initial
###############################################################################
goget:
	go get -u -d -v ./...


###############################################################################
# Build
###############################################################################
bld:
	go build -o wallet ./cmd/wallet/main.go
	go build -o coldwallet ./cmd/coldwallet/main.go

wallet: bld
	./wallet -m 1

cold-wallet: bld
	./coldwallet -m 4


###############################################################################
# Run 入金
###############################################################################
# TODO:定期的に実行して、動作を確認すること(これを自動化しておきたい)

# 入金データを集約し、未署名のトランザクションを作成する
create-unsigned: bld
	./wallet -m 1

# 入金データを集約し、未署名のトランザクションを作成する(更に手数料を調整したい場合)
create-unsigned-fee: bld
	./wallet -m 1 -f 1.5

# 未署名のトランザクションに署名する
sign: bld
	./coldwallet -m 5 -i ./data/tx/receipt/receipt_8_unsigned_1534832793024491932

# 署名済トランザクションを送信する
send: bld
	./wallet -m 2 -i ./data/tx/receipt/receipt_8_signed_1534832879778945174

# 送金ステータスを監視し、6confirmationsになったら、statusをdoneに更新する
	./wallet -m 30

# テストデータ作成のために入金の一連の流れをまとめて実行する
create-receipt-all: bld
	./wallet -m 10

###############################################################################
# Run 出金
###############################################################################
# TODO:定期的に実行して、動作を確認すること(これを自動化しておきたい)

# 出金データから出金トランザクションを作成する
create-payment: bld
	./wallet -m 14

# 出金データから出金トランザクションを作成する(更に手数料を調整したい場合)
create-payment-fee: bld
	./wallet -m 14 -f 1.5

# 出金用に未署名のトランザクションに署名する
sign-payment: bld
	./coldwallet -m 5 -i ./data/tx/payment/payment_3_unsigned_1534832966995082772

# 出金用に署名済トランザクションを送信する
send-payment: bld
	./wallet -m 13 -i ./data/tx/payment/payment_3_signed_1534833088943126101

# テストデータ作成のために出金の一連の流れをまとめて実行する


###############################################################################
# Run 送金監視
###############################################################################
detect-sent-transaction:
	./wallet -m 30

###############################################################################
# Run Debugのための機能確認
###############################################################################
run-debug:
	./wallet -d -m 1

###############################################################################
# Test
###############################################################################
gotest:
	go test -v ./...


###############################################################################
# Docker and compose
###############################################################################
bld-docker-go:
	docker build --no-cache -t cayenne-wallet-go:1.10.3 -f ./docker/golang/Dockerfile .


###############################################################################
# Utility
###############################################################################
.PHONY: clean
clean:
	rm -rf wallet coldwallet